open-vela/contest2026_135_yongwangzhiqian/board/bk7258_t5ai/chip/ap/bk7258_ap_main.c
/****************************************************************************
 * contest2026_135_yongwangzhiqian/board/bk7258_t5ai/chip/ap/bk7258_ap_main.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Minimal AP NuttX init task for physical CPU1.
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <errno.h>
#include <stdbool.h>
#include <sched.h>
#include <stdint.h>
#include <string.h>

#include <nuttx/kmalloc.h>
#include <nuttx/signal.h>

#include <arch/chip/bk7258_amp.h>

#ifdef CONFIG_BK7258_PSRAM
#  include <arch/chip/bk7258_psram.h>
#endif

#ifdef CONFIG_BK7258_RPTUN_MBOX
#  include <arch/chip/bk7258_rptun.h>
#  include "bk7258_rptun_mbox.h"
#endif
#ifdef CONFIG_BK7258_RPTUN
#  include "bk7258_rptun.h"
#endif
#ifdef CONFIG_BK7258_AP_SUPERVISOR
#  include "bk7258_ap_health.h"
#endif
#ifdef CONFIG_BK7258_BT_IPC
#  include <arch/chip/bk7258_bt_ipc.h>
#endif
#ifdef CONFIG_BK7258_BLE_GATT
#  include <arch/chip/bk7258_ble_gatt.h>
#endif
#ifdef CONFIG_BK7258_WIFI_VNET
#  include <arch/chip/bk7258_wifi.h>
#endif

#include "arm_internal.h"
#include "bk7258_clockdiag.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define BK7258_SCB_VTOR             (*(volatile uint32_t *)0xe000ed08u)
#define BK7258_SYSTICK_CTRL         (*(volatile uint32_t *)0xe000e010u)
#define BK7258_SYSTICK_RELOAD       (*(volatile uint32_t *)0xe000e014u)
#define BK7258_SYSTICK_CURRENT      (*(volatile uint32_t *)0xe000e018u)
#define BK7258_SYSTICK_ENABLE       (1u << 0)
#define BK7258_SYSTICK_TICKINT      (1u << 1)
#define BK7258_SCB_CCR              (*(volatile uint32_t *)0xe000ed14u)
#define BK7258_SCB_CCR_DCACHE       (1u << 16)
#define BK7258_MPU_CTRL             (*(volatile uint32_t *)0xe000ed94u)
#define BK7258_MPU_RNR              (*(volatile uint32_t *)0xe000ed98u)
#define BK7258_MPU_RBAR             (*(volatile uint32_t *)0xe000ed9cu)
#define BK7258_MPU_RLAR             (*(volatile uint32_t *)0xe000eda0u)
#define BK7258_MPU_MAIR0            (*(volatile uint32_t *)0xe000edc0u)
#define BK7258_MPU_SRAM_REGION      15u
#define BK7258_MPU_SRAM_RBAR        0x2800001au
#define BK7258_MPU_SRAM_RLAR        0x3fffffe3u
#ifdef CONFIG_BK7258_PSRAM
#  define BK7258_MPU_PSRAM_REGION   6u
#  define BK7258_MPU_PSRAM_RBAR     0x60000002u
#  define BK7258_MPU_PSRAM_RLAR     0x63ffffe3u
#endif
#define BK7258_MPU_ATTR1_MASK       0x0000ff00u
#define BK7258_MPU_ATTR1_NOCACHE    0x00004400u
#define BK7258_MPU_CTRL_EXPECTED    0x7u
#ifdef CONFIG_BK7258_AP_SUPERVISOR
#  define BK7258_AP_HEARTBEAT_US \
    ((uint32_t)CONFIG_BK7258_AP_HEARTBEAT_PERIOD_MS * 1000u)
#else
#  define BK7258_AP_HEARTBEAT_US    100000u
#endif

#ifdef CONFIG_BK7258_RPTUN
#  define BK7258_AP_RPTUN_INIT_PRIORITY  226
static_assert(BK7258_AP_RPTUN_INIT_PRIORITY >
              CONFIG_BK7258_RPTUN_RX_PRIORITY,
              "AP RPTUN init coordinator must outrank RX worker");
static_assert(BK7258_AP_RPTUN_INIT_PRIORITY > CONFIG_RPTUN_PRIORITY,
              "AP RPTUN init coordinator must outrank RPTUN worker");
#endif

#ifdef CONFIG_BK7258_AP_SMP_SCHED_ONLINE
#  define BK7258_CPU2_EXPECTED_STATE \
    BK7258_CPU2_PROBE_STATE_SCHEDULER_ONLINE
#  define BK7258_CPU2_EXPECTED_MASK  0x3u
#else
#  define BK7258_CPU2_EXPECTED_STATE \
    BK7258_CPU2_PROBE_STATE_SECONDARY_READY
#  define BK7258_CPU2_EXPECTED_MASK  0x1u
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

#ifdef CONFIG_BK7258_RPTUN_MBOX
static uint32_t bk7258_ap_mbox_receive(void)
{
  return bk7258_rptun_mbox_take_lifecycle();
}

static void bk7258_ap_mbox_send(uint32_t event)
{
  volatile struct bk7258_ap_boot_state_s *state = bk7258_ap_boot_state();

  if (bk7258_rptun_mbox_send(BK7258_RPTUN_MBOX_LIFECYCLE,
                             state->generation, event) >= 0)
    {
      state->ap_to_cp_doorbells++;
    }

  __asm volatile ("dmb sy" ::: "memory");
}
#else
static inline volatile uint32_t *bk7258_ap_mbox(uint32_t base)
{
  return (volatile uint32_t *)(uintptr_t)base;
}

static void bk7258_ap_mbox_ack(volatile uint32_t *mbox)
{
  mbox[BK7258_MBOX_CLEAR_OFFSET / 4] = BK7258_MBOX_BOX0_BIT;
  __asm volatile ("dsb sy" ::: "memory");
  mbox[BK7258_MBOX_READY_OFFSET / 4] = 0;
  mbox[BK7258_MBOX_CLEAR_OFFSET / 4] = 0;
  __asm volatile ("dsb sy" ::: "memory");
}

static uint32_t bk7258_ap_mbox_receive(void)
{
  volatile uint32_t *mbox = bk7258_ap_mbox(BK7258_MBOX0_BASE);
  uint32_t event = BK7258_AP_EVENT_NONE;

  if ((mbox[BK7258_MBOX_READY_OFFSET / 4] &
       BK7258_MBOX_BOX0_BIT) != 0)
    {
      if (mbox[BK7258_MBOX_PARAM0_OFFSET / 4] ==
          BK7258_AP_DOORBELL_MAGIC)
        {
          event = mbox[BK7258_MBOX_PARAM1_OFFSET / 4];
        }

      bk7258_ap_mbox_ack(mbox);
    }

  return event;
}

static void bk7258_ap_mbox_send(uint32_t event)
{
  volatile uint32_t *mbox = bk7258_ap_mbox(BK7258_MBOX1_BASE);
  volatile struct bk7258_ap_boot_state_s *state = bk7258_ap_boot_state();

  if ((mbox[BK7258_MBOX_READY_OFFSET / 4] &
       BK7258_MBOX_BOX0_BIT) != 0)
    {
      bk7258_ap_mbox_ack(mbox);
    }

  mbox[BK7258_MBOX_SENDER_OFFSET / 4] = 1u << 1;
  mbox[BK7258_MBOX_RECEIVER_OFFSET / 4] = 1u << 0;
  mbox[BK7258_MBOX_PARAM0_OFFSET / 4] = BK7258_AP_DOORBELL_MAGIC;
  mbox[BK7258_MBOX_PARAM1_OFFSET / 4] = event;
  mbox[BK7258_MBOX_PARAM2_OFFSET / 4] = state->generation;
  mbox[BK7258_MBOX_PARAM3_OFFSET / 4] = state->state;
  __asm volatile ("dmb sy" ::: "memory");
  mbox[BK7258_MBOX_READY_OFFSET / 4] = BK7258_MBOX_BOX0_BIT;
  state->ap_to_cp_doorbells++;
  __asm volatile ("dsb sy; sev" ::: "memory");
}
#endif

static void bk7258_ap_publish_failure(uint32_t error)
{
  volatile struct bk7258_ap_boot_state_s *state = bk7258_ap_boot_state();

