open-vela/contest2026_135_yongwangzhiqian/board/bk7258_t5ai/chip/ap/bk7258_ap_main.c
  state->error = error;
  __asm volatile ("dmb sy" ::: "memory");
  state->state = BK7258_AP_STATE_FAILED;
  __asm volatile ("dmb sy" ::: "memory");
  bk7258_ap_mbox_send(BK7258_AP_EVENT_FAILED);
}

static int bk7258_ap_validate_runtime(void)
{
  volatile struct bk7258_ap_boot_state_s *state = bk7258_ap_boot_state();
  void *test;
  uint32_t mpu_rnr;
#ifdef CONFIG_BK7258_PSRAM
  uint32_t psram_rbar;
  uint32_t psram_rlar;
#endif
  uint32_t msp;

  __asm volatile ("mrs %0, msp" : "=r"(msp));

  state->runtime_vtor    = BK7258_SCB_VTOR;
  state->runtime_msp     = msp;
  state->clock_hz        = bk7258_clockdiag_current_cpu_hz();
  state->systick_ctrl    = BK7258_SYSTICK_CTRL;
  state->systick_reload  = BK7258_SYSTICK_RELOAD;
  state->systick_current = BK7258_SYSTICK_CURRENT;
  state->heap_start      = (uint32_t)g_idle_topstack;
  state->heap_end        = BK7258_AP_HEAP_END;
  state->ram_start       = BK7258_AP_RAM_BASE;
  state->ram_end         = BK7258_AP_RAM_BASE + BK7258_AP_RAM_SIZE;
  state->flash_start     = BK7258_AP_FLASH_ADDR;
  state->flash_end       = BK7258_AP_FLASH_ADDR + BK7258_AP_FLASH_SIZE;

  /* Publish the cache/MPU handoff contract in the normal-boot reserved
   * words.  The fault handler intentionally reuses these words if a later
   * exception occurs, so a debugger can distinguish normal telemetry from
   * fault evidence through state->state/error.
   */

  mpu_rnr = BK7258_MPU_RNR;
  BK7258_MPU_RNR = BK7258_MPU_SRAM_REGION;
  __asm volatile ("dsb sy; isb sy" ::: "memory");
  state->reserved[0] = BK7258_SCB_CCR;
  state->reserved[1] = BK7258_MPU_CTRL;
  state->reserved[2] = BK7258_MPU_RBAR;
  state->reserved[3] = BK7258_MPU_RLAR;
#ifdef CONFIG_BK7258_PSRAM
  BK7258_MPU_RNR = BK7258_MPU_PSRAM_REGION;
  __asm volatile ("dsb sy; isb sy" ::: "memory");
  psram_rbar = BK7258_MPU_RBAR;
  psram_rlar = BK7258_MPU_RLAR;
#endif
  BK7258_MPU_RNR = mpu_rnr;
  __asm volatile ("dsb sy; isb sy" ::: "memory");

  if (*(volatile uint32_t *)BK7258_LOCAL_CORE_ID_ADDR != 0 ||
      state->physical_core_id != 1)
    {
      return BK7258_AP_ERROR_BAD_CORE_ID;
    }

  if ((state->reserved[0] & BK7258_SCB_CCR_DCACHE) != 0 ||
      (state->reserved[1] & BK7258_MPU_CTRL_EXPECTED) !=
        BK7258_MPU_CTRL_EXPECTED ||
      state->reserved[2] != BK7258_MPU_SRAM_RBAR ||
      state->reserved[3] != BK7258_MPU_SRAM_RLAR ||
#ifdef CONFIG_BK7258_PSRAM
      psram_rbar != BK7258_MPU_PSRAM_RBAR ||
      psram_rlar != BK7258_MPU_PSRAM_RLAR ||
#endif
      (BK7258_MPU_MAIR0 & BK7258_MPU_ATTR1_MASK) !=
        BK7258_MPU_ATTR1_NOCACHE)
    {
      return BK7258_AP_ERROR_BAD_BOOT_STATE;
    }

  if (state->runtime_vtor < BK7258_AP_RAM_BASE ||
      state->runtime_vtor >= BK7258_SHARED_RAM_BASE ||
      (state->runtime_vtor & 0x1ffu) != 0)
    {
      return BK7258_AP_ERROR_BAD_VTOR;
    }

  if ((state->systick_ctrl &
       (BK7258_SYSTICK_ENABLE | BK7258_SYSTICK_TICKINT)) !=
      (BK7258_SYSTICK_ENABLE | BK7258_SYSTICK_TICKINT) ||
      state->systick_reload == 0)
    {
      return BK7258_AP_ERROR_BAD_SYSTICK;
    }

  test = kmm_malloc(64);
  if (test == NULL)
    {
      return BK7258_AP_ERROR_HEAP;
    }

  memset(test, 0xa5, 64);
  state->heap_test = (uint32_t)(uintptr_t)test;
  kmm_free(test);
  return BK7258_AP_ERROR_NONE;
}

#ifdef CONFIG_BK7258_AP_SMP_BOOTSTRAP
static int bk7258_ap_validate_secondary_bootstrap(void)
{
  volatile struct bk7258_cpu2_probe_state_s *cpu2 =
    bk7258_cpu2_probe_state();
#ifdef CONFIG_BK7258_AP_IPI
  volatile struct bk7258_ap_ipi_state_s *ipi = bk7258_ap_ipi_state();
#endif
#ifdef CONFIG_BK7258_AP_SMP_SCHED_ONLINE
  volatile struct bk7258_ap_smp_state_s *smp = bk7258_ap_smp_state();
#endif
  __asm volatile ("dmb sy" ::: "memory");

  if (cpu2->magic != BK7258_CPU2_PROBE_STATE_MAGIC ||
      cpu2->version != BK7258_CPU2_PROBE_STATE_VERSION ||
      cpu2->size != sizeof(struct bk7258_cpu2_probe_state_s) ||
      cpu2->generation != bk7258_ap_boot_state()->generation ||
      cpu2->state != BK7258_CPU2_EXPECTED_STATE ||
      cpu2->error != BK7258_CPU2_PROBE_ERROR_NONE ||
      cpu2->secondary_ready != 1 ||
      cpu2->online_mask != BK7258_CPU2_EXPECTED_MASK ||
      cpu2->local_core_id != 1 ||
      cpu2->physical_core_id != 2 ||
      cpu2->runtime_vtor != cpu2->vector ||
      cpu2->runtime_msp <= BK7258_CPU2_BOOT_STACK_BASE ||
      cpu2->runtime_msp > BK7258_CPU2_BOOT_STACK_TOP ||
      cpu2->idle_stack_base < BK7258_AP_RAM_BASE ||
      cpu2->idle_stack_base >= cpu2->idle_stack_top ||
      cpu2->idle_stack_top > BK7258_CPU2_BOOT_STACK_BASE)
    {
      return BK7258_AP_ERROR_CPU2_SMP_BOOTSTRAP;
    }

#ifdef CONFIG_BK7258_AP_IPI
  if (ipi->magic != BK7258_AP_IPI_STATE_MAGIC ||
      ipi->version != BK7258_AP_IPI_STATE_VERSION ||
      ipi->size != sizeof(struct bk7258_ap_ipi_state_s) ||
      ipi->generation != bk7258_ap_boot_state()->generation ||
      ipi->state != BK7258_AP_IPI_STATE_READY ||
      ipi->error != BK7258_AP_IPI_ERROR_NONE)
    {
      return BK7258_AP_ERROR_CPU2_IPI;
    }
#endif

#ifdef CONFIG_BK7258_AP_SMP_SCHED_ONLINE
  if (smp->magic != BK7258_AP_SMP_STATE_MAGIC ||
      smp->version != BK7258_AP_SMP_STATE_VERSION ||
      smp->size != sizeof(struct bk7258_ap_smp_state_s) ||
      smp->generation != bk7258_ap_boot_state()->generation ||
      smp->state != BK7258_AP_SMP_STATE_ONLINE ||
      smp->error != BK7258_AP_SMP_ERROR_NONE ||
      smp->online_mask != BK7258_CPU2_EXPECTED_MASK)
    {
      return BK7258_AP_ERROR_CPU2_SMP_SCHEDULER;
    }
#endif

  return BK7258_AP_ERROR_NONE;
}
#endif

/****************************************************************************
 * Public Functions
 ****************************************************************************/

int bk7258_ap_main(int argc, char *argv[])
{
  volatile struct bk7258_ap_boot_state_s *state = bk7258_ap_boot_state();
#ifdef CONFIG_BK7258_RPTUN
  volatile struct bk7258_rptun_control_s *rptun =
    bk7258_rptun_control();
  struct sched_param saved_priority;
  struct sched_param startup_priority;
  bool priority_raised = false;
#endif
#ifdef CONFIG_BK7258_AP_SMP_SCHED_ONLINE
  volatile struct bk7258_ap_smp_state_s *smp = bk7258_ap_smp_state();
#endif
#ifdef CONFIG_BK7258_BLE_GATT
  struct bk7258_ble_gatt_stats_s ble_gatt;
#endif
#ifdef CONFIG_BK7258_PSRAM_TEST
  struct bk7258_psram_test_result_s psram_test;
#endif
  uint32_t event;
  int error;
  int ret;

  (void)argc;
  (void)argv;

