open-vela/contest2026_135_yongwangzhiqian/board/bk7258_t5ai/chip/ap/bk7258_ap_main.c
  if (state->magic != BK7258_AP_BOOT_STATE_MAGIC ||
      state->version != BK7258_AP_BOOT_STATE_VERSION ||
      state->size != sizeof(struct bk7258_ap_boot_state_s))
    {
      bk7258_ap_publish_failure(BK7258_AP_ERROR_BAD_BOOT_STATE);
      goto parked;
    }

  error = bk7258_ap_validate_runtime();
  if (error != BK7258_AP_ERROR_NONE)
    {
      bk7258_ap_publish_failure((uint32_t)error);
      goto parked;
    }

#ifdef CONFIG_BK7258_PSRAM
  ret = bk7258_psram_initialize();
  if (ret < 0)
    {
      bk7258_ap_publish_failure(BK7258_AP_ERROR_PSRAM);
      goto parked;
    }

  state->reserved[BK7258_PSRAM_AP_RESERVED_HEAP] =
    BK7258_PSRAM_AP_HEAP_BASE;
  state->reserved[BK7258_PSRAM_AP_RESERVED_GATE] =
    BK7258_PSRAM_AP_HEAP_READY;
#ifdef CONFIG_BK7258_PSRAM_TEST
  memset(&psram_test, 0, sizeof(psram_test));
  state->reserved[BK7258_PSRAM_AP_RESERVED_RESULT] =
    (uint32_t)(uintptr_t)&psram_test;
  state->reserved[BK7258_PSRAM_AP_RESERVED_MAGIC] =
    BK7258_PSRAM_AP_RESULT_READY;
#endif
  __asm volatile ("dmb sy" ::: "memory");
#endif

#ifdef CONFIG_BK7258_RPTUN
  /* kthread_create() activates the new task before returning.  Both the
   * mailbox RX worker and stock RPTUN worker intentionally outrank normal
   * applications, but they must not outrank the coordinator which is still
   * constructing and pinning them.  Otherwise a cold-start context switch
   * can leave this init path inside kthread_create() indefinitely.  After
   * READY, N10 keeps this primary management/heartbeat loop at its reserved
   * supervisor priority; profiles without N10 restore the init priority.
   */

  ret = sched_getparam(0, &saved_priority);
  if (ret < 0)
    {
      bk7258_ap_publish_failure(BK7258_AP_ERROR_BAD_BOOT_STATE);
      goto parked;
    }

  startup_priority = saved_priority;
  startup_priority.sched_priority = BK7258_AP_RPTUN_INIT_PRIORITY;
  ret = sched_setparam(0, &startup_priority);
  if (ret < 0)
    {
      bk7258_ap_publish_failure(BK7258_AP_ERROR_BAD_BOOT_STATE);
      goto parked;
    }

  priority_raised = true;
#endif

#ifdef CONFIG_BK7258_AP_SMP_BOOTSTRAP
  error = bk7258_ap_validate_secondary_bootstrap();
  if (error != BK7258_AP_ERROR_NONE)
    {
      bk7258_ap_publish_failure((uint32_t)error);
      goto parked;
    }
#else
  ret = bk7258_cpu2_probe_start(BK7258_CPU2_PROBE_TIMEOUT_MS);
  if (ret < 0)
    {
      bk7258_ap_publish_failure(BK7258_AP_ERROR_CPU2_PROBE);
      goto parked;
    }
#endif

#ifdef CONFIG_BK7258_AP_SMP_SCHED_ONLINE
  ret = bk7258_ap_smp_scheduler_selftest(
    BK7258_AP_SMP_DEFAULT_TIMEOUT_MS);
  if (ret < 0)
    {
      bk7258_ap_publish_failure(BK7258_AP_ERROR_CPU2_SMP_SCHEDULER);
      goto parked;
    }
#endif

#ifdef CONFIG_BK7258_AP_SMP_CPU1_AFFINITY
#  ifdef CONFIG_BK7258_AP_SMP_CPU1_SEM_WAKE_LOOP
  ret = bk7258_ap_smp_affinity_selftest(
    BK7258_AP_SEM_WAKE_LOOP_TIMEOUT_MS);
#  elif defined(CONFIG_BK7258_AP_SMP_CPU1_SEM_WAKE)
  ret = bk7258_ap_smp_affinity_selftest(
    BK7258_AP_SEM_WAKE_TIMEOUT_MS);
#  else
  ret = bk7258_ap_smp_affinity_selftest(
    BK7258_AP_AFFINITY_TIMEOUT_MS);
#  endif
  if (ret < 0)
    {
#ifdef CONFIG_BK7258_AP_SMP_CPU1_SEM_WAKE_LOOP
      bk7258_ap_publish_failure(BK7258_AP_ERROR_CPU2_SEM_WAKE_LOOP);
#elif defined(CONFIG_BK7258_AP_SMP_CPU1_SEM_WAKE)
      bk7258_ap_publish_failure(BK7258_AP_ERROR_CPU2_SEM_WAKE);
#else
      bk7258_ap_publish_failure(BK7258_AP_ERROR_CPU2_AFFINITY);
#endif
      goto parked;
    }
#endif

#ifdef CONFIG_BK7258_AP_SMP_BIDIR_PINGPONG
  ret = bk7258_ap_smp_bp2p_selftest(BK7258_AP_ADV_TIMEOUT_MS);
  if (ret < 0)
    {
      bk7258_ap_publish_failure(BK7258_AP_ERROR_CPU2_BP2P);
      goto parked;
    }
#elif defined(CONFIG_BK7258_AP_SMP_CPU1_DUALTASK)
  ret = bk7258_ap_smp_bdul_selftest(BK7258_AP_ADV_TIMEOUT_MS);
  if (ret < 0)
    {
      bk7258_ap_publish_failure(BK7258_AP_ERROR_CPU2_BDUL);
      goto parked;
    }
#elif defined(CONFIG_BK7258_AP_SMP_CONTROLLED_MIGRATION)
  ret = bk7258_ap_smp_bmig_selftest(BK7258_AP_ADV_TIMEOUT_MS);
  if (ret < 0)
    {
      bk7258_ap_publish_failure(BK7258_AP_ERROR_CPU2_BMIG);
      goto parked;
    }
#elif defined(CONFIG_BK7258_AP_SMP_CPU1_TIMED_WAKE)
  ret = bk7258_ap_smp_btim_selftest(BK7258_AP_ADV_TIMEOUT_MS);
  if (ret < 0)
    {
      bk7258_ap_publish_failure(BK7258_AP_ERROR_CPU2_BTIM);
      goto parked;
    }
#elif defined(CONFIG_BK7258_AP_SMP_LIFECYCLE_QUIESCE)
  ret = bk7258_ap_smp_blcy_selftest(BK7258_AP_ADV_TIMEOUT_MS);
  if (ret < 0)
    {
      bk7258_ap_publish_failure(BK7258_AP_ERROR_CPU2_BLCY);
      goto parked;
    }
#endif

#ifdef CONFIG_BK7258_PSRAM_TEST
  ret = bk7258_psram_heap_test(CONFIG_BK7258_PSRAM_TEST_ITERATIONS,
                               true, &psram_test);
  if (ret < 0 || psram_test.status < 0 ||
      psram_test.completed[0] != CONFIG_BK7258_PSRAM_TEST_ITERATIONS ||
      psram_test.completed[1] != CONFIG_BK7258_PSRAM_TEST_ITERATIONS ||
      psram_test.observed_cpu[0] != 0u ||
      psram_test.observed_cpu[1] != 1u)
    {
      bk7258_ap_publish_failure(BK7258_AP_ERROR_PSRAM);
      goto parked;
    }

  state->reserved[BK7258_PSRAM_AP_RESERVED_GATE] =
    BK7258_PSRAM_AP_TEST_PASSED;
  __asm volatile ("dmb sy" ::: "memory");
#endif

  /* Publish a second, independently scheduled liveness source only after all
   * N8 SMP gates have passed.  The task is permanent for this AP generation
   * and pinned to logical CPU1; a failed first increment is a startup failure,
   * not a degraded READY state.
   */

#ifdef CONFIG_BK7258_AP_SUPERVISOR
  ret = bk7258_ap_health_initialize();
  if (ret < 0)
    {
      bk7258_ap_publish_failure(BK7258_AP_ERROR_SUPERVISOR);
      goto parked;
    }
#endif

  /* Keep AP-local N8 validation ahead of logical transport ownership so its
   * zero-length SMP IPI gates run without RPMsg traffic.  The SDK physical
   * MBOX0 driver was already initialized by the AP SMP bootstrap.  The
   * temporarily elevated coordinator priority above is what makes the later
   * synchronous worker creation deterministic; changing the SDK/NuttX source
   * or moving logical transport ahead of the N8 gates is unnecessary.
   */

#ifdef CONFIG_BK7258_RPTUN_MBOX
#ifdef CONFIG_BK7258_RPTUN
  __atomic_fetch_or((uint32_t *)(uintptr_t)&rptun->flags,
                    BK7258_RPTUN_FLAG_AP_MBOX_ENTER, __ATOMIC_RELEASE);
#endif
  ret = bk7258_rptun_mbox_initialize();
  if (ret < 0)
    {
      bk7258_ap_publish_failure(BK7258_AP_ERROR_BAD_BOOT_STATE);
      goto parked;
    }

#ifdef CONFIG_BK7258_RPTUN
  __atomic_fetch_or((uint32_t *)(uintptr_t)&rptun->flags,
                    BK7258_RPTUN_FLAG_AP_MBOX_READY, __ATOMIC_RELEASE);
#endif
#endif

#ifdef CONFIG_BK7258_RPTUN
  __atomic_fetch_or((uint32_t *)(uintptr_t)&rptun->flags,
                    BK7258_RPTUN_FLAG_AP_RPTUN_ENTER, __ATOMIC_RELEASE);
  ret = bk7258_rptun_initialize(state->generation);
  if (ret < 0)
    {
      bk7258_ap_publish_failure(BK7258_AP_ERROR_BAD_BOOT_STATE);
      goto parked;
    }

#ifdef CONFIG_BK7258_RPMSGFS
  ret = bk7258_rpmsgfs_initialize();
  if (ret < 0)
    {
      bk7258_ap_publish_failure(BK7258_AP_ERROR_RPMSGFS);
      goto parked;
    }
#endif

  __atomic_fetch_or((uint32_t *)(uintptr_t)&rptun->flags,
                    BK7258_RPTUN_FLAG_AP_RPTUN_READY, __ATOMIC_RELEASE);
#endif

#ifdef CONFIG_BK7258_WIFI_VNET
  ret = bk7258_wifi_initialize();
  if (ret < 0)
    {
      bk7258_ap_publish_failure(BK7258_AP_ERROR_WIFI);
      goto parked;
    }

