open-vela/contest2026_135_yongwangzhiqian/board/bk7258_t5ai/chip/ap/bk7258_ap_main.c
  ret = bk7258_wifi_control_initialize();
  if (ret < 0)
    {
      bk7258_ap_publish_failure(BK7258_AP_ERROR_WIFI);
      goto parked;
    }
#endif

#ifdef CONFIG_BK7258_BT_IPC
  ret = bk7258_bt_hci_initialize();
  if (ret < 0)
    {
      bk7258_ap_publish_failure(BK7258_AP_ERROR_BLUETOOTH);
      goto parked;
    }
#endif

#ifdef CONFIG_BK7258_BLE_GATT
  ret = bk7258_ble_gatt_initialize();
  if (ret < 0)
    {
      bk7258_ap_publish_failure(BK7258_AP_ERROR_BLUETOOTH);
      goto parked;
    }

  ret = bk7258_ble_gatt_get_stats(&ble_gatt);
  if (ret < 0 ||
      ble_gatt.state != BK7258_BLE_GATT_STATE_ADVERTISING ||
      ble_gatt.worker_cpu != 0u)
    {
      bk7258_ap_publish_failure(BK7258_AP_ERROR_BLUETOOTH);
      goto parked;
    }
#endif

  state->error      = BK7258_AP_ERROR_NONE;
  state->last_event = BK7258_AP_EVENT_READY;
  state->state      = BK7258_AP_STATE_READY;
#ifdef CONFIG_BK7258_RPTUN
  rptun->ap_epoch   = state->generation;
  __atomic_fetch_or((uint32_t *)(uintptr_t)&rptun->flags,
                    BK7258_RPTUN_FLAG_AP_READY, __ATOMIC_RELEASE);
#endif
  __asm volatile ("dmb sy" ::: "memory");
  bk7258_ap_mbox_send(BK7258_AP_EVENT_READY);

#ifdef CONFIG_BK7258_RPTUN
  if (priority_raised)
    {
#ifdef CONFIG_BK7258_AP_SUPERVISOR
      startup_priority = saved_priority;
      startup_priority.sched_priority =
        CONFIG_BK7258_AP_SUPERVISOR_PRIORITY;
      ret = sched_setparam(0, &startup_priority);
      if (ret < 0)
        {
          bk7258_ap_publish_failure(BK7258_AP_ERROR_SUPERVISOR);
          goto parked;
        }
#else
      (void)sched_setparam(0, &saved_priority);
#endif
    }
#endif

  for (; ; )
    {
      event = bk7258_ap_mbox_receive();
      if (event != BK7258_AP_EVENT_NONE)
        {
          state->last_event = event;
        }

      if (event == BK7258_AP_EVENT_STOP ||
          state->command == BK7258_AP_COMMAND_STOP)
        {
          state->state = BK7258_AP_STATE_STOPPING;
          __asm volatile ("dmb sy" ::: "memory");
#ifdef CONFIG_BK7258_AP_SMP_BOOTSTRAP
          ret = bk7258_ap_smp_secondary_stop(
            BK7258_CPU2_PROBE_STOP_TIMEOUT_MS);
#else
          ret = bk7258_cpu2_probe_stop(
            BK7258_CPU2_PROBE_STOP_TIMEOUT_MS);
#endif
          if (ret < 0)
            {
#ifdef CONFIG_BK7258_AP_SMP_BOOTSTRAP
              state->error = BK7258_AP_ERROR_CPU2_SMP_BOOTSTRAP;
#else
              state->error = BK7258_AP_ERROR_CPU2_PROBE;
#endif
              state->state = BK7258_AP_STATE_FAILED;
              state->last_event = BK7258_AP_EVENT_FAILED;
              bk7258_ap_mbox_send(BK7258_AP_EVENT_FAILED);
              break;
            }

          state->state = BK7258_AP_STATE_STOPPED;
          state->last_event = BK7258_AP_EVENT_STOPPED;
          bk7258_ap_mbox_send(BK7258_AP_EVENT_STOPPED);
          break;
        }

#ifdef CONFIG_BK7258_AP_IPI
      if (event == BK7258_AP_EVENT_IPI_TEST ||
          state->command == BK7258_AP_COMMAND_IPI_TEST)
        {
          volatile struct bk7258_ap_ipi_state_s *ipi =
            bk7258_ap_ipi_state();

          state->command = BK7258_AP_COMMAND_NONE;
          __asm volatile ("dmb sy" ::: "memory");
          ret = bk7258_ap_ipi_selftest(ipi->requested_count,
                                       ipi->timeout_ms);
          if (ret < 0)
            {
              state->error = BK7258_AP_ERROR_CPU2_IPI;
              state->last_event = BK7258_AP_EVENT_IPI_TEST_FAILED;
              bk7258_ap_mbox_send(BK7258_AP_EVENT_IPI_TEST_FAILED);
            }
          else
            {
              state->error = BK7258_AP_ERROR_NONE;
              state->last_event = BK7258_AP_EVENT_IPI_TEST_PASSED;
              bk7258_ap_mbox_send(BK7258_AP_EVENT_IPI_TEST_PASSED);
            }
        }
#endif

      state->heartbeat++;
#if defined(CONFIG_BK7258_AP_SUPERVISOR) && defined(CONFIG_BK7258_RPTUN)
      if (rptun->generation == state->generation)
        {
          rptun->ap_epoch = state->generation;
          __atomic_fetch_add(
            (uint32_t *)(uintptr_t)&rptun->ap_heartbeat, 1u,
            __ATOMIC_RELEASE);
        }
#endif
#ifdef CONFIG_BK7258_AP_SMP_SCHED_ONLINE
      smp->sleep_enter_count++;
#endif
      __asm volatile ("dmb sy; sev" ::: "memory");
      nxsig_usleep(BK7258_AP_HEARTBEAT_US);
#ifdef CONFIG_BK7258_AP_SMP_SCHED_ONLINE
      smp->sleep_return_count++;
      __asm volatile ("dmb sy" ::: "memory");
#endif
    }

parked:
  __asm volatile ("cpsid i; dsb sy; isb sy" ::: "memory");
  for (; ; )
    {
      __asm volatile ("wfe");
    }

  return 0;
}
